Джира/src/Documents/Центр_ТрудозатратыПоЗадаче/Центр_ТрудозатратыПоЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Центр_ТрудозатратыПоЗадаче</name>
  <basedOn>Document.Центр_Задача</basedOn>
  <registerRecords>AccumulationRegister.Центр_ЧасыТрудозатрат</registerRecords>
  <attributes>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </attributes>
</mdclass:Document>

Джира/src/AccumulationRegisters/Центр_ЧасыТрудозатрат/Центр_ЧасыТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Центр_ЧасыТрудозатрат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Джира/src/InformationRegisters/Центр_ОценкаЧасов/Центр_ОценкаЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ОценкаЧасов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/Enums/Центр_ТипОценкиЧасов/Центр_ТипОценкиЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Центр_ТипОценкиЧасов</name>
  <enumValues>
    <name>Рамочная</name>
  </enumValues>
  <enumValues>
    <name>Точная</name>
  </enumValues>
  <enumValues>
    <name>ПоФакту</name>
  </enumValues>
</mdclass:Enum>

Джира/src/Documents/Центр_ТрудозатратыПоЗадаче/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Центр_Задача") Тогда
		Часы = 8;
		Основание = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Центр_ЧасыТрудозатрат.Записывать = Истина;	
	Движение = Движения.Центр_ЧасыТрудозатрат.Добавить();
	Движение.Период = Дата;
	Движение.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	Движение.Часы = Часы;	
	Движения.Центр_ЧасыТрудозатрат.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Центр_ЧасыТрудозатрат.Часы) КАК Часы,
	|	Центр_ТрудозатратыПоЗадаче.Основание
	|ПОМЕСТИТЬ вт_ЧасыПоЗадаче
	|ИЗ
	|	Документ.Центр_ТрудозатратыПоЗадаче КАК Центр_ТрудозатратыПоЗадаче
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Центр_ЧасыТрудозатрат КАК Центр_ЧасыТрудозатрат
	|		ПО Центр_ЧасыТрудозатрат.Регистратор = Центр_ТрудозатратыПоЗадаче.Ссылка
	|		И Центр_ТрудозатратыПоЗадаче.Основание = &Задача
	|СГРУППИРОВАТЬ ПО
	|	Центр_ТрудозатратыПоЗадаче.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ЧасыПоЗадаче.Часы,
	|	Центр_ОценкаЧасовСрезПоследних.До,
	|	Центр_ОценкаЧасовСрезПоследних.ТипОценки
	|ИЗ
	|	вт_ЧасыПоЗадаче КАК вт_ЧасыПоЗадаче
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Центр_ОценкаЧасов.СрезПоследних(, Задача = &Задача) КАК
	|			Центр_ОценкаЧасовСрезПоследних
	|		ПО вт_ЧасыПоЗадаче.Основание = Центр_ОценкаЧасовСрезПоследних.Задача
	|ГДЕ
	|	Центр_ОценкаЧасовСрезПоследних.Согласовано";

	Запрос.УстановитьПараметр("Задача", Основание);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Если Выборка.ТипОценки <> ПредопределенноеЗначение("Перечисление.Центр_ТипОценкиЧасов.ПоФакту") Тогда
			ЧасыИтог = 	Выборка.До - Выборка.Часы;
			Если ЧасыИтог < 0 Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Часов больше чем согласовано на " + (-ЧасыИтог) + " часов";
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
